tobozo/Arduino/boards.txt
menu.UploadSpeed=Upload Speed
menu.CpuFrequency=CPU Frequency
menu.FlashSize=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.UploadTool=Upload Using
menu.ResetMethod=Reset Method


##############################################################
dstike.name=Dstike by Travis Lin

dstike.upload.tool=esptool
dstike.upload.speed=115200
dstike.upload.resetmethod=ck
dstike.upload.maximum_size=434160
dstike.upload.maximum_data_size=81920
dstike.upload.wait_for_upload_port=true
dstike.serial.disableDTR=true
dstike.serial.disableRTS=true

dstike.build.mcu=esp8266
dstike.build.f_cpu=80000000L
dstike.build.board=ESP8266_ESP01
dstike.build.core=esp8266
dstike.build.variant=generic
dstike.build.flash_mode=qio
dstike.build.spiffs_pagesize=256

dstike.menu.UploadTool.esptool=Serial
dstike.menu.UploadTool.esptool.upload.tool=esptool
dstike.menu.UploadTool.esptool.upload.verbose=-vv
dstike.menu.UploadTool.espota=OTA
dstike.menu.UploadTool.espota.upload.tool=espota

dstike.menu.CpuFrequency.80=80 MHz
dstike.menu.CpuFrequency.80.build.f_cpu=80000000L
dstike.menu.CpuFrequency.160=160 MHz
dstike.menu.CpuFrequency.160.build.f_cpu=160000000L

dstike.menu.FlashFreq.40=40MHz
dstike.menu.FlashFreq.40.build.flash_freq=40
dstike.menu.FlashFreq.80=80MHz
dstike.menu.FlashFreq.80.build.flash_freq=80

dstike.menu.FlashMode.dio=DIO
dstike.menu.FlashMode.dio.build.flash_mode=dio
dstike.menu.FlashMode.qio=QIO
dstike.menu.FlashMode.qio.build.flash_mode=qio

dstike.menu.UploadSpeed.921600=921600
dstike.menu.UploadSpeed.921600.upload.speed=921600
dstike.menu.UploadSpeed.115200=115200
dstike.menu.UploadSpeed.115200.upload.speed=115200

dstike.menu.FlashSize.1M256=1M (256K SPIFFS)
dstike.menu.FlashSize.1M256.build.flash_size=1M
dstike.menu.FlashSize.1M256.build.flash_ld=eagle.flash.1m256.ld
dstike.menu.FlashSize.1M256.build.spiffs_start=0xBB000
dstike.menu.FlashSize.1M256.build.spiffs_end=0xFB000
dstike.menu.FlashSize.1M256.build.spiffs_blocksize=4096
dstike.menu.FlashSize.1M256.upload.maximum_size=761840

dstike.menu.ResetMethod.nodemcu=nodemcu
dstike.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu
dstike.menu.ResetMethod.ck=ck
dstike.menu.ResetMethod.ck.upload.resetmethod=ck


##############################################################
generic.name=Generic ESP8266 Module

generic.upload.tool=esptool
generic.upload.speed=115200
generic.upload.resetmethod=ck
generic.upload.maximum_size=434160
generic.upload.maximum_data_size=81920
generic.upload.wait_for_upload_port=true
generic.serial.disableDTR=true
generic.serial.disableRTS=true

generic.build.mcu=esp8266
generic.build.f_cpu=80000000L
generic.build.board=ESP8266_ESP01
generic.build.core=esp8266
generic.build.variant=generic
generic.build.flash_mode=qio
generic.build.spiffs_pagesize=256

generic.menu.UploadTool.esptool=Serial
generic.menu.UploadTool.esptool.upload.tool=esptool
generic.menu.UploadTool.esptool.upload.verbose=-vv
generic.menu.UploadTool.espota=OTA
generic.menu.UploadTool.espota.upload.tool=espota

generic.menu.CpuFrequency.80=80 MHz
generic.menu.CpuFrequency.80.build.f_cpu=80000000L
generic.menu.CpuFrequency.160=160 MHz
generic.menu.CpuFrequency.160.build.f_cpu=160000000L

generic.menu.FlashFreq.40=40MHz
generic.menu.FlashFreq.40.build.flash_freq=40
generic.menu.FlashFreq.80=80MHz
generic.menu.FlashFreq.80.build.flash_freq=80

generic.menu.FlashMode.dio=DIO
generic.menu.FlashMode.dio.build.flash_mode=dio
generic.menu.FlashMode.qio=QIO
generic.menu.FlashMode.qio.build.flash_mode=qio

generic.menu.UploadSpeed.115200=115200
generic.menu.UploadSpeed.115200.upload.speed=115200
generic.menu.UploadSpeed.9600=9600
generic.menu.UploadSpeed.9600.upload.speed=9600
generic.menu.UploadSpeed.57600=57600
generic.menu.UploadSpeed.57600.upload.speed=57600
generic.menu.UploadSpeed.256000.windows=256000
generic.menu.UploadSpeed.256000.upload.speed=256000
generic.menu.UploadSpeed.230400.linux=230400
generic.menu.UploadSpeed.230400.macosx=230400
generic.menu.UploadSpeed.230400.upload.speed=230400
generic.menu.UploadSpeed.460800.linux=460800
generic.menu.UploadSpeed.460800.macosx=460800
generic.menu.UploadSpeed.460800.upload.speed=460800
generic.menu.UploadSpeed.512000.windows=512000
generic.menu.UploadSpeed.512000.upload.speed=512000
generic.menu.UploadSpeed.921600=921600
generic.menu.UploadSpeed.921600.upload.speed=921600

generic.menu.FlashSize.512K64=512K (64K SPIFFS)
generic.menu.FlashSize.512K64.build.flash_size=512K
generic.menu.FlashSize.512K64.build.flash_ld=eagle.flash.512k64.ld
generic.menu.FlashSize.512K64.build.spiffs_start=0x6B000
generic.menu.FlashSize.512K64.build.spiffs_end=0x7B000
generic.menu.FlashSize.512K64.build.spiffs_blocksize=4096
generic.menu.FlashSize.512K64.upload.maximum_size=434160

generic.menu.FlashSize.512K0=512K (no SPIFFS)
generic.menu.FlashSize.512K0.build.flash_size=512K
generic.menu.FlashSize.512K0.build.flash_ld=eagle.flash.512k0.ld
generic.menu.FlashSize.512K0.upload.maximum_size=499696

generic.menu.FlashSize.1M512=1M (512K SPIFFS)
generic.menu.FlashSize.1M512.build.flash_size=1M
generic.menu.FlashSize.1M512.build.flash_ld=eagle.flash.1m512.ld
generic.menu.FlashSize.1M512.build.spiffs_start=0x7B000
generic.menu.FlashSize.1M512.build.spiffs_end=0xFB000
generic.menu.FlashSize.1M512.build.spiffs_blocksize=8192
generic.menu.FlashSize.1M512.upload.maximum_size=499696

generic.menu.FlashSize.1M256=1M (256K SPIFFS)
generic.menu.FlashSize.1M256.build.flash_size=1M
generic.menu.FlashSize.1M256.build.flash_ld=eagle.flash.1m256.ld
generic.menu.FlashSize.1M256.build.spiffs_start=0xBB000
generic.menu.FlashSize.1M256.build.spiffs_end=0xFB000
generic.menu.FlashSize.1M256.build.spiffs_blocksize=4096
generic.menu.FlashSize.1M256.upload.maximum_size=761840

generic.menu.FlashSize.1M128=1M (128K SPIFFS)
generic.menu.FlashSize.1M128.build.flash_size=1M
generic.menu.FlashSize.1M128.build.flash_ld=eagle.flash.1m128.ld
generic.menu.FlashSize.1M128.build.spiffs_start=0xDB000
generic.menu.FlashSize.1M128.build.spiffs_end=0xFB000
generic.menu.FlashSize.1M128.build.spiffs_blocksize=4096
generic.menu.FlashSize.1M128.upload.maximum_size=892912

